aroyer-qc/GRBL_Digini_STM32Fx/module/Digini/Grafx/src/driver/STM32F4xx/lib_STM32F4_lcd_common.cpp
        // the length of one line of pixels in bytes + 3 then :
        // Line Lenth = Active high width x number of bytes per pixel + 3
        // Active high width         = LCD_SIZE_Y
        LTDC_Layer_InitStruct.LTDC_CFBLineLength = ((GRAFX_SIZE_X * (uint32_t)PixelSize) + 3);

        // the pitch is the increment from the start of one line of pixels to the
        // start of the next line in bytes, then :
        // Pitch = Active high width x number of bytes per pixel
        LTDC_Layer_InitStruct.LTDC_CFBPitch      = (GRAFX_SIZE_X * (uint32_t)PixelSize);
        LTDC_Layer_InitStruct.LTDC_CFBLineNumber =  GRAFX_SIZE_Y;                                              // Configure the number of lines

        LTDC_LayerInit(pLTDC_SelectedLayer, &LTDC_Layer_InitStruct);

        if(bDriverInitialize == true)
        {
            LTDC_LayerCmd(pLTDC_SelectedLayer, ENABLE);
        }

        LTDC_ReloadConfig(LTDC_VBReload);
    }
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DisplayOn
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Enables the Display
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DisplayOn()
{
    //GPIO_ResetBits(LCD_BL_CTRL_PORT, LCD_BL_CTRL_PIN);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_DisplayOff
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Disables the Display
//
//  Note(s):
//
//-------------------------------------------------------------------------------------------------
void DRV_DisplayOff()
{
    //GRAFX_GPIO_SetBits(LCD_BL_CTRL_PORT, LCD_BL_CTRL_PIN);
}


//-------------------------------------------------------------------------------------------------
//
//  Name:           DRV_WaitFor_V_Sync
//
//  Parameter(s):   None
//  Return:         None
//
//  Description:    Wait for the vertical synchro
//
//  Note(s):        this will prevent glitching on screen while changing display
//
//-------------------------------------------------------------------------------------------------
void DRV_WaitFor_V_Sync()
{
    // Wait for Vertical sync to occur
    while(LTDC_GetCDStatus(LTDC_CDSR_VSYNCS) != SET);
}


#endif // STM32F429_439xx
#endif // DIGINI_USE_GRAFX
